#+OPTIONS: toc:nil -:nil H:6 ^:nil
#+EXCLUDE_TAGS: no_export
#+BEGIN_EXAMPLE
---
title: "JavaScript"
layout: notation
description:
path: "/javascript/"
---
#+END_EXAMPLE

* testing with code blocks

#+BEGIN_SRC js
let colors = [ "red", "purple", "green" ];
if (x) {
  console.log('cl');
}
let [ firstColor, ...remain ] = colors;
console.log(firstColor);
console.log(remain);
#+END_SRC

#+RESULTS:
: red
: [ 'purple', 'green' ]
: undefined

#+BEGIN_SRC js2
if (x) {
  console.log('zxcv');
}
let colors = [ "red", "purple", "green" ];
let [ firstColor, ...remain ] = colors;
console.log(firstColor);
console.log(remain);
#+END_SRC



** Objects

#+BEGIN_SRC js :cmd "org-babel-node"
  let structured = {
    title: 'structured title',
    description: 'structured desc'
  }

  const { title, description } = structured;

  console.log(title);
  console.log(description);
#+END_SRC

#+RESULTS:
: structured title
: structured desc
: undefined


#+BEGIN_SRC js :cmd "org-babel-node --presets=stage-2"
let obj1 = {
  bird: "falcon2",
  frog: "bullfrog"
}
let { bird, frog: frogName } = obj1;
console.log(bird);
console.log(frogName);

let obj2 = {
  fruit: "apple",
  veggie: "kale",
  meat: "tofuball"
}
let { fruit, ...restItem } = obj2;
console.log(fruit);
console.log(restItem);
#+END_SRC

#+RESULTS:

* SCRATCH / TEST :no_export:

#+BEGIN_SRC js :cmd "org-babel-node"
let props = {
  object: {},
  string: '',
  array: []
}
console.log(props);
#+END_SRC

#+RESULTS:
: { postData: { title: 'pd-title', description: 'pd-desc', path: 'pd-path' },
:   title: 'reg-title',
:   description: 'reg-desc',
:   path: 'reg-path' }
: undefined


#+BEGIN_SRC js :cmd "org-babel-node --presets=es2015"
  const animals = ['dog', 'cat']

  animals.map((anim) => {
    console.log('anim', anim);
  })
#+END_SRC

#+RESULTS:
: anim dog
: anim cat
: undefined
